# Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)

print (' - - - Определение индексов заданных значений списка - - -  ', "\n")

# Подключение модулей
import random

# Объявление переменных и ввод данных
length = int (input ('Введите длину списка: '))
min_range = int ( input ('Введите нижнюю границу случайных значений для заполнения списка: '))
max_range = int ( input ('Введите верхнюю границу случайных значений для заполнения списка: '))
spisok = list()
num = []

# Заполнение списка случайными значениями и информирование Пользователя
for j in range (0, length):
    spisok.append (random.randint (min_range, max_range + 1))

print (f'Всего в списке {len(spisok)} значений', "\n")
print(spisok, "\n")

# Объявление дополнительных переменных и ввод значений интервала
a = int (input('Введите минимальную границу искомого интервала: '))
b = int (input('Введите максимальную границу искомого интервала: '))
k = 0
print()

# Проверка выполнения условия и нахождение индексов искомых элементов
for i in range (0, len(spisok)) :
    
    if spisok [i] >= a and spisok [i] <= b :
    
        num.append(i)
        k += 1
if k == 0:
    print ('Список не содержит значений из искомого диапазона')
else:
    print(f'Индексы элементов искомого интервала {num}') # Вывод результата
